[MESSAGE_UIEDITOR]
0=属性的名字不能为空！
1=属性名不满足C语言命名规范！
2=属性的注释不能为空！
3=创建目录未成功
4=删除成功！
5=对不起，请勿使用'common'作为AP工程名称！
6=请填写工程名称！
7=请设置工程目录路径！
8=对不起，工程已存在！路径：
9=请填写新建子场景模板的名称！
10=创建子场景模板目录失败！
11=请选择规格大小相同的图片！ 宽 x 高：
12=您未选中任何控件！
13=该属性已经存在！
14=请从控件列表中选择一个控件!
15=请选择一张背景图!
16=超过最大允许选择文件数(1000)，请分批次选择文件!
17=还没有选中某一项！
18=请从图片资源中选取一项！
19=请从字符串资源中选中一项！
20=创建Excel服务失败!
21=请选择工程目录！
22=在该工程目录下创建新目录不成功！
23=图片的宽度请保持与picColon的图片宽度一致:
24=对不起，删除失败！
25=此工程文件已不存在！
26=提示：%s 和 %s 需要保持尺寸大小一致
27=若需要改变此尺寸，请先将此图片以外的其它23张图片清空，再重新选择其它尺寸的图片，即可。
28=子场景模板：%s 中PictureBox的图层不能为空！
29=场景：%s 中PictureBox的图层不能为空！
30=编辑注释
31=保存
32=取消
33=真的要将'%s'从子场景模板库中删除？
34=正在删除，请稍候
35=子场景模板(新建请右键此处)
36=请选择目录：
37=选择文件
38=格式不正确！
39=宋体
40=左对齐
41=居中
42=右对齐
43=正在加载资源
44=工作区：
45=控件外围矩形
46=控件名称
47=控件id
48=图层编号
49=图层
50=图片类型
51=普通图标
52=非嵌入式背景图
53=嵌入式背景图
54=前景图标
55=前景图标透明色
56=子场景模板名称
57=控件左上角x坐标
58=控件左上角y坐标
59=真的要将属性'%s'删除么？
60=删除AttributeBox属性
61=横向
62=背景颜色
63=背景图片（single）
64=背景图片（multy）
65=字符串
66=图片名称
67=路径
68=可作为背景图的图片:
69=真的要将列表清空么？
70=图片资源
71=字符串资源
72=请选择路径：
73=滑动杆
74=两者都有
75=多行
76=空白分隔符
77=冒号分隔符
78=斜杠分隔符
79=短横线分隔符
80=空值
81=工程：
82=子场景模板
83=已经发生改变，是否需要保存？
84=正在生成资源
85=您还没有选择一张欢迎图片
86=您还没有选择生成的RES资源存放目录
87=您所选取的欢迎图片已不存在
88=目录：\"%s\" 下已有welcom.res资源文件存在。若继续，将会对现有文件进行覆盖，是否继续？
89=真的要将ap工程'%s'删除么？
90=选择
91=填充式
92=提示
93=对话框说明
94=选项
95=滚屏
96=参数设置
97=AP工程视图
98=属性信息视图
99=控件区视图
100=工程结构树视图
101=子场景模板区视图
102=子场景模板工程视图
103=找不到控件:id=
104=列表项
105=列表标题


[CONTROL_UIEDITOR]


[MESSAGE_CHANGETO24BMP]
0=请选择需要转换的图片目录！
1=请选择转换后的图片存放的目录！
2=此目录不存在！
3=结果目录不能和源目录相同！
4=创建目录：%s 失败！
5=正在统计文件总数...
6=未在源目录下发现BMP图片
7=部分图片未转换成功
8=所有文件转换失败！
9=转换成功！
10=请选择存放目录：
11=转成24位位图

[CONTROL_CHANGETO24BMP]
1=转24位位图
2=退出
1012=需要转换的图片目录路径：
1013=转换后的图片保存位置：
1005=[打开结果目录]
1007=[查看失败列表]